Revit 2024 API
DuctFittingAndAccessoryData Members
The DuctFittingAndAccessoryData type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the DuctFittingAndAccessoryData
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAllConnectorData
 Gets the connector data of the pipe fitting or pipe accessory.
GetEntity
 Returns an Entity of the Schema of the serverGUID. or an invalid entity otherwise.
GetFamilyInstanceId
 Gets the Id of the fiting or accessory instance
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
AirViscosity
 The kinematic viscosity of air for the duct fitting or duct accessory, Units: (ft^2/s).
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Origin
 The origin position of the duct fitting or duct accessory.
PartType
 The part type of the duct fitting or duct accessory.
ServerGUID
 The GUID of the duct fitting or duct accessory.
SystemClassification
 The system classification of the duct fitting or duct accessory.
See Also
DuctFittingAndAccessoryData Class
Autodesk.Revit.DB.Mechanical Namespace